app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-07-22 20:04:57.254277"], ["updated_at", "2017-07-22 20:04:57.254277"]]
---
  def create
    @student = Student.new(post_params(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-07-22 20:04:57.517467"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(post_params(:first_name, :last_name))